tutorials/combustion/fireFoam/les/smallPoolFire3D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    sides
    {
        type            totalPressure;
        p0              $internalField;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           0;
        value           $internalField;
    }
    base
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
